{
  "format": "layers-model",
  "generatedBy": "Spectra Manual Generator",
  "convertedBy": "Soroush",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              48,
              48,
              1
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input_layer"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "output_layer",
            "trainable": true,
            "units": 7,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "output_layer/kernel",
          "shape": [
            2304,
            7
          ],
          "dtype": "float32"
        },
        {
          "name": "output_layer/bias",
          "shape": [
            7
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}