{
  "format": "layers-model",
  "generatedBy": "Spectra Manual Export",
  "convertedBy": "Soroush",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "spectra_export",
      "trainable": true,
      "dtype": "float32",
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              1
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_1",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.25,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_2",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_3",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_3",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.25,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_4",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_4",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_5",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_5",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_2",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.25,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              6,
              6,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_6",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              6,
              6,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_6",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              6,
              6,
              256
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_3",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              6,
              6,
              256
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.25,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              3,
              3,
              256
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              3,
              3,
              256
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              2304
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_7",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              512
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_4",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              512
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              512
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_8",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "synchronized": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              256
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_5",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              256
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "spectra_output",
            "trainable": true,
            "dtype": "float32",
            "units": 7,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              256
            ]
          }
        }
      ]
    },
    "keras_version": "3.3.3",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            32,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            3,
            3,
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            2304,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            512,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "kernel",
          "shape": [
            256,
            7
          ],
          "dtype": "float32"
        },
        {
          "name": "bias",
          "shape": [
            7
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}